SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
/* 故障码 (FOC_CH4-V1.2 第 11 页附表), 回码 DATA1 / 上报帧 DATA2 */
#define FOC_FAULT_NONE       0
#define FOC_FAULT_DRIVER     1
#define FOC_FAULT_OVERCURR   5
#define FOC_FAULT_OVERVOLT   6
#define FOC_FAULT_UNDERVOLT  7    /* 24V 电池带 36V 额定电机, 重点怀疑对象 */
#define FOC_FAULT_OVERTEMP   8
#define FOC_FAULT_HALL_M2    23
#define FOC_FAULT_HALL_M1    24
#define FOC_FAULT_STALL_M2   25
#define FOC_FAULT_STALL_M1   26
#define FOC_FAULT_UART       27
#define FOC_FAULT_RS485      28
#define FOC_FAULT_CAN        29

/*------------------ 命令帧的加减速斜坡 (DATA4 / DATA5) ------------
 *  驱动器文档原文: "当前转速为 0rpm, 目标 100rpm, 若设置间隔为 1ms,
 *  则目标转速值每 1ms 加 1, 直至 100rpm"。
 *  即 DATA4 的单位是 **ms / 每 1 RPM**, 范围 0~100, 0 = 阶跃(响应最快)。
 *
 *  ★ 现在改回 0 (阶跃)。原因:
 *    当初从 0 改成 3 是为了让起步柔和、少顶过流保护, 但**一直没做 A/B**。
 *    后来实测发现底盘直线会漂 (用户目测 2 米偏 40°, 约 20°/m), 而在更早
 *    (还是 ESP32 当上位机的年代) 的记录里是 7.4°/m —— 也就是变差了 2.7 倍。
 *    命令帧格式两代完全一致(厂商 Cmd_Vel_Callback 和自己写的 ESP32 发的
 *    是同一套 11 字节), CAN 重发周期也都是 20ms, **两代之间唯一的运动相关
 *    差异就是这个斜坡参数**。所以先把它改回 0, 把变量消掉再看。
 *
 *    如果改回 0 之后漂移没变化, 说明斜坡无关, 那就是驱动器速度环本身的
 *    问题(它确实在振荡: 目标 18RPM 时实际在 0~22 之间来回冲)。
 *    那时再把斜坡加回来也不迟 —— 它本来是为了柔顺, 不是为了准确。
 *
 *  减速保持 0: 要停就立刻停, 别拖泥带水(停车安全优先)。 */
#define ACCEL_STEP_MS      0
#define DECEL_STEP_MS      0

/*-------------------------- 协议 --------------------------------*/
#define CMD_FRAME_SIZE     11
#define CMD_HEAD           0x7B
#define TEL_FRAME_SIZE     24
#define TEL_HEAD           0x7B
#define TEL_TAIL           0x7D
#define DIAG_FRAME_SIZE    36
#define DIAG_HEAD          0x7E
#define DIAG_TAIL          0x7D

/* 命令帧里的功能码(f[1]), 沿用协议里"非速度帧靠功能码区分"的做法。
 * 协议已占用: 0x04 灯带 / 0x01 回充开关 / 0x00 安全防护, 0x05 是空的。 */
#define FUNC_RELAY         0x05     /* f[2] = 掩码: bit0 电机继电器 bit1 水泵继电器 */

/*-------------------------- 周期 --------------------------------*/
#define CAN_PERIOD_MS      20       /* 向电机重复发送的周期 */
#define ODOM_PERIOD_MS     20       /* 轮速采样/(可选)卡尔曼周期 (50Hz) */
#define TELEMETRY_PERIOD_MS 50      /* 上报周期 (20Hz) */
#define RPM_STALE_MS       200      /* 驱动器这么久没回码就认为转速无效 */

/*-------------------------- IMU --------------------------------*/
/* IMU 读一次大概 1~3ms(位翻转 I2C), 和轮速一起按 ODOM_PERIOD_MS 采样。
 *
 * ★ 协议要求上报的 IMU 原始值必须是 ±2g / ±500dps 量程下的值, 因为上位机
 *   是用固定系数换算的(MD 5.1 节):
 *       加速度: 原始值 / 1671.84    = m/s²
 *       陀螺仪: 原始值 * 0.00026644 = rad/s
 *   而 YbImu 的原始量程是 ±16g / ±2000dps, 所以这里必须换算 + 限幅。
 *   换错量程不会报错, 只会让上位机的数据全错。
 */
#define IMU_ACCEL_G_TO_RAW  (9.80665f * 1671.84f)   /* g      -> ±2g   原始值 */
#define IMU_GYRO_TO_RAW     (1.0f / 0.00026644f)    /* rad/s  -> ±500dps 原始值 */
#define IMU_GYRO_Z_SIGN     1       /* 陀螺 Z 轴方向; 见下面 IMU_Tick 里的用法 */

/*=========================== 全局状态 ==============================*/
volatile uint32_t g_tick_ms;

/*---------------------- 串口口 (就一个) ----------------------------*/
#define PORT_MAIN   0
#define PORT_COUNT  1

typedef struct
{
    uint8_t  id;
    USART_TypeDef *usart;
    uint8_t  ring[64];                  /* 接收环形缓冲 */
    volatile uint8_t head;
    volatile uint8_t tail;
    volatile uint8_t overflow;
    uint8_t  frame[CMD_FRAME_SIZE];     /* 组帧滑动窗口 */
    uint8_t  len;
    uint8_t  ok_count;
    uint8_t  bad_count;
} uart_port_t;

static uart_port_t ports[PORT_COUNT];

/* 目标 / 状态 */
static float    target_vx;          /* m/s */
static float    target_wz;          /* rad/s */
static uint8_t  ever_linked;
static uint8_t  failsafe_latched;

/* 物理轮速目标 —— 上报给上位机, 用来和实际轮速对比(诊断"没劲"的关键) */
static int16_t  target_left_rpm;
static int16_t  target_right_rpm;

static uint32_t last_cmd_ms;
static uint32_t last_can_ms;
static uint32_t last_odom_ms;
static uint32_t last_tel_ms;

/* 诊断计数 */
static uint8_t  can_error_count;

/* 驱动器回码 (控制帧 ...E601 的应答, 每个字段来自同一帧, 时间戳共用 m*_rpm_ms) */
static volatile uint8_t m1_fault, m2_fault;     /* DATA1 故障码, 见 FOC_FAULT_* */
static volatile uint8_t m1_mode,  m2_mode;      /* DATA0 当前运行模式 0x05/0x06... */
static volatile int16_t m1_rpm,   m2_rpm;       /* DATA2/3 实际转速 RPM */
static volatile int16_t m1_cur,   m2_cur;       /* DATA4/5 输出扭矩电流, A x100 */
static uint32_t m1_rpm_ms, m2_rpm_ms;
static volatile uint16_t battery_mv;

/* 轮速计 */
static int16_t  wheel_left_rpm, wheel_right_rpm;   /* 已按接线校准的物理轮速 */
static float    body_vx, body_wz;                  /* 轮速正解出的车体速度 */

/* IMU (YbImu, 位翻转 I2C on PB10/PB11) */
static float    imu_accel_g[3];      /* 单位 g */
static float    imu_gyro[3];         /* 单位 rad/s */

/* IMU 诊断状态 —— 通过诊断帧上报, 方便查 I2C 接线/器件问题 */
static uint8_t  imu_ok;              /* 1 = 加速度有效 */
static uint8_t  imu_gyro_ok;         /* 1 = 陀螺仪有效(不是恒 0) */
static uint8_t  imu_status;          /* YBIMU_ST_* 失败原因 */
static uint8_t  imu_found_addr;      /* 扫描到的器件地址, 0 = 没扫到 */
static uint32_t imu_diag_ms;         /* 上次诊断的时刻 */

/* IMU 寄存器体检结果 (1Hz 刷一次)。
   陀螺仪恒 0 时靠它区分"只有陀螺仪坏"还是"整个模块只剩加速度可用"。 */
static uint8_t  imu_probe_flags;     /* bit0 版本 bit1 陀螺 bit2 磁力 bit3 四元数 bit4 欧拉 */
static uint8_t  imu_ver_major;
static int16_t  imu_euler_yaw_crad;  /* 模块自己融合的偏航角, 单位 0.01rad */
static uint32_t imu_probe_ms;        /* 上次寄存器体检的时刻 */

/* 继电器 */
static uint8_t  relay_state;                       /* bit0 电机 bit1 水泵 */

/*=========================== 1ms 时基 ==============================*/
static void Tick_Init(void)
{
    TIM_TimeBaseInitTypeDef tim;
    NVIC_InitTypeDef nvic;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    tim.TIM_Prescaler = 7200 - 1;          /* 72MHz / 7200 = 10kHz */
    tim.TIM_CounterMode = TIM_CounterMode_Up;
    tim.TIM_Period = 10 - 1;               /* 10kHz / 10  = 1kHz -> 1ms */
    tim.TIM_ClockDivision = TIM_CKD_DIV1;
    tim.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM2, &tim);

    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

    nvic.NVIC_IRQChannel = TIM2_IRQn;
    nvic.NVIC_IRQChannelPreemptionPriority = 1;
    nvic.NVIC_IRQChannelSubPriority = 0;
    nvic.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&nvic);

    TIM_Cmd(TIM2, ENABLE);
}

void TIM2_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)
    {
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
        g_tick_ms++;
    }
}

/*======================= 独立看门狗 (IWDG) =========================
 * ★ 为什么必须有它: 原来只有"软件看门狗" —— 在主循环里检查上位机多久没发
 *   命令。**但它本身也在主循环里**: 一旦主循环卡住(比如某处死等), 软件看门狗
 *   也跟着停, STM32 就再也不发 CAN 命令了。
 *
 *   而 FOC 驱动器**没有命令超时** —— 它会一直执行最后收到的那条命令。
 *   于是最坏情况是: 主循环卡死 -> STM32 静默 -> 驱动器保持最后的速度
 *   -> **车自己开走**。
 *
 *   IWDG 用的是芯片内部独立的 40kHz LSI(不受主时钟影响), 主循环卡住超过
 *   超时时间就强制复位 MCU。复位后 main() 会在 CAN 初始化完的第一时间发
 *   刹车帧, 车就停下了。
 *
 *   超时 = 预分频 / LSI * 重装值 = 64 / 40000 * 625 = 1.0 秒。
 *   (LSI 实际在 30~60kHz 之间飘, 所以真实超时约 0.67~1.33 秒, 够用。)
 *
 *   IWDG 一旦使能就**关不掉**, 只能靠复位。所以初始化放在这里、喂狗放主循环。
 *=================================================================*/
static void IWDG_Init(void)
{
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
    IWDG_SetPrescaler(IWDG_Prescaler_64);   /* 40kHz / 64 = 625Hz */
    IWDG_SetReload(625);                    /* 625 / 625Hz = 1 秒 */
    IWDG_ReloadCounter();
    IWDG_Enable();
}

/*============================= CAN1 ================================*/
static void CAN1_Init(void)
{
    GPIO_InitTypeDef gpio;
    CAN_InitTypeDef can;
    CAN_FilterInitTypeDef filter;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);

    gpio.GPIO_Pin = GPIO_Pin_12;               /* CAN1_TX */
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &gpio);

    gpio.GPIO_Pin = GPIO_Pin_11;               /* CAN1_RX */
    gpio.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &gpio);

    CAN_DeInit(CAN1);
    CAN_StructInit(&can);
    can.CAN_TTCM = DISABLE;
    can.CAN_ABOM = ENABLE;
    can.CAN_AWUM = ENABLE;
    can.CAN_NART = DISABLE;
    can.CAN_RFLM = DISABLE;
    can.CAN_TXFP = DISABLE;
    can.CAN_Mode = CAN_Mode_Normal;
    can.CAN_SJW = CAN_SJW_1tq;
    can.CAN_BS1 = CAN_BS1_8tq;
    can.CAN_BS2 = CAN_BS2_3tq;
    /* PCLK1 = 36MHz: 36 / 6 / (1 + 8 + 3) = 500 kbit/s */
    can.CAN_Prescaler = 6;
    CAN_Init(CAN1, &can);

    filter.CAN_FilterNumber = 0;
    filter.CAN_FilterMode = CAN_FilterMode_IdMask;
    filter.CAN_FilterScale = CAN_FilterScale_32bit;
    filter.CAN_FilterIdHigh = 0;
    filter.CAN_FilterIdLow = 0;
    filter.CAN_FilterMaskIdHigh = 0;
    filter.CAN_FilterMaskIdLow = 0;
    filter.CAN_FilterFIFOAssignment = CAN_Filter_FIFO0;
    filter.CAN_FilterActivation = ENABLE;
    CAN_FilterInit(&filter);
}

static void CAN1_SendRaw(uint32_t id, uint8_t dlc, const uint8_t *data)
{
    CanTxMsg tx;
    uint8_t mailbox;
    uint8_t status;
    uint8_t index;
    uint32_t timeout;

    tx.StdId = 0;
    tx.ExtId = id;
    tx.IDE = CAN_Id_Extended;
    tx.RTR = CAN_RTR_Data;
    tx.DLC = dlc;
    for (index = 0; index < 8; index++)
    {
        tx.Data[index] = (index < dlc) ? data[index] : 0;
    }

